ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32H5xx/hal_lld.h
 * @brief   STM32H5xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32H503xx.
 *          - STM32H562xx, STM32H563xx, STM32H573xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2           TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32H503xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H5 High-performance"

#elif defined(STM32H562xx) || defined(STM32H563xx)
#define PLATFORM_NAME           "STM32H5 High-performance"

#elif defined(STM32H573xx)
#define PLATFORM_NAME           "STM32H5 High-performance with security"

#else
#error "STM32H5 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32H5XX) || defined(__DOXYGEN__)
#define STM32H5XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_SYSCLK              0U
#define CLK_PLL1PCLK            1U
#define CLK_PLL1QCLK            2U
#define CLK_PLL1RCLK            3U
#define CLK_PLL2PCLK            4U
#define CLK_PLL2QCLK            5U
#define CLK_PLL2RCLK            6U
#define CLK_PLL3PCLK            7U
#define CLK_PLL3QCLK            8U
#define CLK_PLL3RCLK            9U
#define CLK_HCLK                10U
#define CLK_PCLK1               11U
#define CLK_PCLK1TIM            12U
#define CLK_PCLK2               13U
#define CLK_PCLK2TIM            14U
#define CLK_MCO1                15U
#define CLK_MCO2                16U
#define CLK_LSCO                17U
#define CLK_ARRAY_SIZE          18U
/** @} */

/**
 * @name    VOS field definitions
 * @{
 */
#define STM32_VOS_MASK          (3U << 14)  /**< Core voltage mask.         */
#define STM32_VOS_RANGE3        (0U << 14)  /**< Core voltage 1 Volt.       */
#define STM32_VOS_RANGE2        (1U << 14)  /**< Core voltage 1.1 Volts.    */
#define STM32_VOS_RANGE1        (2U << 14)  /**< Core voltage 1.2 Volts.    */
#define STM32_VOS_RANGE0        (3U << 14)  /**< Core voltage 1.35 Volts.   */
/** @} */

/**
 * @name    RCC_CR register bits definitions
 * @{
 */
#define STM32_HSIDIV_MASK       (3U << 3)
#define STM32_HSIDIV_FIELD(n)   ((n) << 3)
#define STM32_HSIDIV_DIV1       STM32_HSIDIV_FIELD(0U)
#define STM32_HSIDIV_DIV2       STM32_HSIDIV_FIELD(1U)
#define STM32_HSIDIV_DIV4       STM32_HSIDIV_FIELD(2U)
#define STM32_HSIDIV_DIV8       STM32_HSIDIV_FIELD(3U)
/** @} */

/**
 * @name    RCC_CFGR1 register bits definitions
 * @{
 */
#define STM32_SW_MASK           (3U << 0)
#define STM32_SW_FIELD(n)       ((n) << 0)
#define STM32_SW_HSI            STM32_SW_FIELD(1U)
#define STM32_SW_CSI            STM32_SW_FIELD(2U)
#define STM32_SW_HSE            STM32_SW_FIELD(2U)
#define STM32_SW_PLL1P          STM32_SW_FIELD(3U)

#define STM32_SWS_MASK          (3U << 3)
#define STM32_SWS_FIELD(n)      ((n) << 3)
#define STM32_SWS_HSI           STM32_SWS_FIELD(1U)
#define STM32_SWS_CSI           STM32_SWS_FIELD(2U)
#define STM32_SWS_HSE           STM32_SWS_FIELD(2U)
#define STM32_SWS_PLL1P         STM32_SWS_FIELD(3U)

#define STM32_STOPWUCK_MASK     (1U << 6)
#define STM32_STOPWUCK_FIELD(n) ((n) << 6)
#define STM32_STOPWUCK_HSI      STM32_STOPWUCK_FIELD(0U)
#define STM32_STOPWUCK_CSI      STM32_STOPWUCK_FIELD(1U)

#define STM32_STOPKERWUCK_MASK  (1U << 7)
#define STM32_STOPKERWUCK_FIELD(n) ((n) << 7)
#define STM32_STOPKERWUCK_HSI   STM32_STOPKERWUCK_FIELD(0U)
#define STM32_STOPKERWUCK_CSI   STM32_STOPKERWUCK_FIELD(1U)

#define STM32_RTCPRE_MASK       (63U << 8)
#define STM32_RTCPRE_FIELD(n)   ((n) << 8)
#define STM32_RTCPRE_NOCLOCK    STM32_RTCPRE_FIELD(0U)

#define STM32_TIMPRE_MASK       (1U << 15)
#define STM32_TIMPRE_FIELD(n)   ((n) << 15)
#define STM32_TIMPRE_LOW        STM32_TIMPRE_FIELD(0U)
#define STM32_TIMPRE_HIGH       STM32_TIMPRE_FIELD(1U)

#define STM32_MCO1SEL_MASK      (7U << 22)
#define STM32_MCO1SEL_FIELD(n)  ((n) << 22)
#define STM32_MCO1SEL_HSI       STM32_MCO1PRE_FIELD(0U)
#define STM32_MCO1SEL_LSE       STM32_MCO1PRE_FIELD(1U)
#define STM32_MCO1SEL_HSE       STM32_MCO1PRE_FIELD(2U)
#define STM32_MCO1SEL_PLL1P     STM32_MCO1PRE_FIELD(3U)
#define STM32_MCO1SEL_HSI48     STM32_MCO1PRE_FIELD(4U)

#define STM32_MCO1PRE_MASK      (7U << 18)
#define STM32_MCO1PRE_FIELD(n)  ((n) << 18)
#define STM32_MCO1PRE_NOCLOCK    STM32_MCO1PRE_FIELD(0U)

#define STM32_MCO2SEL_MASK      (7U << 29)
#define STM32_MCO2SEL_FIELD(n)  ((n) << 29)

#define STM32_MCO2SEL_SYSCLK    STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2SEL_PLL2P     STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2SEL_HSE       STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2SEL_PLL1P     STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2SEL_CSI       STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2SEL_LSI       STM32_MCO2PRE_FIELD(5U)

#define STM32_MCO2PRE_MASK      (7U << 18)
#define STM32_MCO2PRE_FIELD(n)  ((n) << 18)
#define STM32_MCO2PRE_NOCLOCK    STM32_MCO2PRE_FIELD(0U)
/** @} */

/**
 * @name    RCC_PLLxCFGR register bits definitions
 * @{
 */
#define STM32_PLL1SRC_MASK       (3 << 0)
#define STM32_PLL1SRC_FIELD(n)   ((n) << 0)
#define STM32_PLL1SRC_NOCLOCK    STM32_PLL1SRC_FIELD(0U)
#define STM32_PLL1SRC_HSI        STM32_PLL1SRC_FIELD(1U)
#define STM32_PLL1SRC_CSI        STM32_PLL1SRC_FIELD(2U)
#define STM32_PLL1SRC_HSE        STM32_PLL1SRC_FIELD(3U)

#define STM32_PLL2SRC_MASK       (3 << 0)
#define STM32_PLL2SRC_FIELD(n)   ((n) << 0)
#define STM32_PLL2SRC_NOCLOCK    STM32_PLL2SRC_FIELD(0U)
#define STM32_PLL2SRC_HSI        STM32_PLL2SRC_FIELD(1U)
#define STM32_PLL2SRC_CSI        STM32_PLL2SRC_FIELD(2U)
#define STM32_PLL2SRC_HSE        STM32_PLL2SRC_FIELD(3U)

