ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
#define STM32_SPI5SEL_MASK      (7U << 12)
#define STM32_SPI5SEL_FIELD(n)  ((n) << 12)
#define STM32_SPI5SEL_PCLK3     STM32_SPI5SEL_FIELD(0U)
#define STM32_SPI5SEL_PLL2P     STM32_SPI5SEL_FIELD(1U)
#define STM32_SPI5SEL_PLL3P     STM32_SPI5SEL_FIELD(2U)
#define STM32_SPI5SEL_HSI       STM32_SPI5SEL_FIELD(3U)
#define STM32_SPI5SEL_CSI       STM32_SPI5SEL_FIELD(4U)
#define STM32_SPI5SEL_HSE       STM32_SPI5SEL_FIELD(5U)

#define STM32_SPI6SEL_MASK      (7U << 15)
#define STM32_SPI6SEL_FIELD(n)  ((n) << 15)
#define STM32_SPI6SEL_PCLK2     STM32_SPI6SEL_FIELD(0U)
#define STM32_SPI6SEL_PLL2P     STM32_SPI6SEL_FIELD(1U)
#define STM32_SPI6SEL_PLL3P     STM32_SPI6SEL_FIELD(2U)
#define STM32_SPI6SEL_HSI       STM32_SPI6SEL_FIELD(3U)
#define STM32_SPI6SEL_CSI       STM32_SPI6SEL_FIELD(4U)
#define STM32_SPI6SEL_HSE       STM32_SPI6SEL_FIELD(5U)

#define STM32_LPUART1SEL_MASK   (7U << 24)
#define STM32_LPUART1SEL_FIELD(n) ((n) << 24)
#define STM32_LPUART1SEL_PCLK3  STM32_LPUART1SEL_FIELD(0U)
#define STM32_LPUART1SEL_PLL2Q  STM32_LPUART1SEL_FIELD(1U)
#define STM32_LPUART1SEL_PLL3Q  STM32_LPUART1SEL_FIELD(2U)
#define STM32_LPUART1SEL_HSI    STM32_LPUART1SEL_FIELD(3U)
#define STM32_LPUART1SEL_CSI    STM32_LPUART1SEL_FIELD(4U)
#define STM32_LPUART1SEL_LSE    STM32_LPUART1SEL_FIELD(5U)
/** @} */

/**
 * @name    RCC_CCIPR4 register bits definitions
 * @{
 */
#define STM32_OSPISEL_MASK      (3U << 0)
#define STM32_OSPISEL_FIELD(n)  ((n) << 0)
#define STM32_OSPISEL_HCLK4     STM32_OSPISEL_FIELD(0U)
#define STM32_OSPISEL_PLL1Q     STM32_OSPISEL_FIELD(1U)
#define STM32_OSPISEL_PLL2R     STM32_OSPISEL_FIELD(2U)
#define STM32_OSPISEL_PER       STM32_OSPISEL_FIELD(3U)

#define STM32_SYSTICKSEL_MASK   (3U << 2)
#define STM32_SYSTICKSEL_FIELD(n) ((n) << 2)
#define STM32_SYSTICKSEL_HCLKDIV8 STM32_SYSTICKSEL_FIELD(0U)
#define STM32_SYSTICKSEL_LSI    STM32_SYSTICKSEL_FIELD(1U)
#define STM32_SYSTICKSEL_LSE    STM32_SYSTICKSEL_FIELD(2U)
#define STM32_SYSTICKSEL_NOCLOCK STM32_SYSTICKSEL_FIELD(3U)

#define STM32_USBSEL_MASK      (3U << 4)
#define STM32_USBSEL_FIELD(n)  ((n) << 4)
#define STM32_USBSEL_NOCLOCK   STM32_USBSEL_FIELD(0U)
#define STM32_USBSEL_PLL1Q     STM32_USBSEL_FIELD(1U)
#define STM32_USBSEL_PLL3Q     STM32_USBSEL_FIELD(2U)
#define STM32_USBSEL_HSI48     STM32_USBSEL_FIELD(3U)

#define STM32_SDMMC1SEL_MASK   (1U << 6)
#define STM32_SDMMC1SEL_FIELD(n) ((n) << 6)
#define STM32_SDMMC1SEL_PLL1Q  STM32_SDMMC1SEL_FIELD(0U)
#define STM32_SDMMC1SEL_PLL2R  STM32_SDMMC1SEL_FIELD(1U)

#define STM32_SDMMC2SEL_MASK   (1U << 7)
#define STM32_SDMMC2SEL_FIELD(n) ((n) << 7)
#define STM32_SDMMC2SEL_PLL1Q  STM32_SDMMC2SEL_FIELD(0U)
#define STM32_SDMMC2SEL_PLL2R  STM32_SDMMC2SEL_FIELD(1U)

#define STM32_I2C1SEL_MASK      (3U << 16)
#define STM32_I2C1SEL_FIELD(n)  ((n) << 16)
#define STM32_I2C1SEL_PCLK1     STM32_I2C1SEL_FIELD(0U)
#define STM32_I2C1SEL_PLL3R     STM32_I2C1SEL_FIELD(1U)
#define STM32_I2C1SEL_HSI       STM32_I2C1SEL_FIELD(2U)
#define STM32_I2C1SEL_CSI       STM32_I2C1SEL_FIELD(3U)

#define STM32_I2C2SEL_MASK      (3U << 18)
#define STM32_I2C2SEL_FIELD(n)  ((n) << 18)
#define STM32_I2C2SEL_PCLK1     STM32_I2C2SEL_FIELD(0U)
#define STM32_I2C2SEL_PLL3R     STM32_I2C2SEL_FIELD(1U)
#define STM32_I2C2SEL_HSI       STM32_I2C2SEL_FIELD(2U)
#define STM32_I2C2SEL_CSI       STM32_I2C2SEL_FIELD(3U)

#define STM32_I2C3SEL_MASK      (3U << 20)
#define STM32_I2C3SEL_FIELD(n)  ((n) << 20)
#define STM32_I2C3SEL_PCLK3     STM32_I2C3SEL_FIELD(0U)
#define STM32_I2C3SEL_PLL3R     STM32_I2C3SEL_FIELD(1U)
#define STM32_I2C3SEL_HSI       STM32_I2C3SEL_FIELD(2U)
#define STM32_I2C3SEL_CSI       STM32_I2C3SEL_FIELD(3U)

#define STM32_I2C4SEL_MASK      (3U << 22)
#define STM32_I2C4SEL_FIELD(n)  ((n) << 22)
#define STM32_I2C4SEL_PCLK3     STM32_I2C4SEL_FIELD(0U)
#define STM32_I2C4SEL_PLL3R     STM32_I2C4SEL_FIELD(1U)
#define STM32_I2C4SEL_HSI       STM32_I2C4SEL_FIELD(2U)
#define STM32_I2C4SEL_CSI       STM32_I2C4SEL_FIELD(3U)

#define STM32_I3C1SEL_MASK      (3U << 24)
#define STM32_I3C1SEL_FIELD(n)  ((n) << 24)
#define STM32_I3C1SEL_PCLK1     STM32_I3C1SEL_FIELD(0U)
#define STM32_I3C1SEL_PLL3R     STM32_I3C1SEL_FIELD(1U)
#define STM32_I3C1SEL_HSI       STM32_I3C1SEL_FIELD(2U)
/** @} */

/**
 * @name    RCC_CCIPR5 register bits definitions
 * @{
 */
#define STM32_ADCDACSEL_MASK    (3U << 0)
#define STM32_ADCDACSEL_FIELD(n) ((n) << 0)
#define STM32_ADCDACSEL_HCLK    STM32_ADCDACSEL_FIELD(0U)
#define STM32_ADCDACSEL_SYSCLK  STM32_ADCDACSEL_FIELD(1U)
#define STM32_ADCDACSEL_PLL2R   STM32_ADCDACSEL_FIELD(2U)
#define STM32_ADCDACSEL_HSE     STM32_ADCDACSEL_FIELD(3U)
#define STM32_ADCDACSEL_HSI     STM32_ADCDACSEL_FIELD(4U)
#define STM32_ADCDACSEL_CSI     STM32_ADCDACSEL_FIELD(5U)

#define STM32_DACSEL_MASK       (1U << 3)
#define STM32_DACSEL_FIELD(n)   ((n) << 3)
#define STM32_DACSEL_LSI        STM32_DACSEL_FIELD(0U)
#define STM32_DACSEL_LSE        STM32_DACSEL_FIELD(1U)

#define STM32_RNGSEL_MASK      (3U << 4)
#define STM32_RNGSEL_FIELD(n)  ((n) << 4)
#define STM32_RNGSEL_HSI48     STM32_RNGSEL_FIELD(0U)
#define STM32_RNGSEL_PLL1Q     STM32_RNGSEL_FIELD(1U)
#define STM32_RNGSEL_LSE       STM32_RNGSEL_FIELD(2U)
#define STM32_RNGSEL_LSI       STM32_RNGSEL_FIELD(3U)

#define STM32_CECSEL_MASK      (3U << 6)
#define STM32_CECSEL_FIELD(n)  ((n) << 6)
#define STM32_CECSEL_LSE       STM32_CECSEL_FIELD(0U)
#define STM32_CECSEL_LSI       STM32_CECSEL_FIELD(1U)
#define STM32_CECSEL_CSIDIV128 STM32_CECSEL_FIELD(2U)

#define STM32_FDCANSEL_MASK    (3U << 8)
#define STM32_FDCANSEL_FIELD(n) ((n) << 8)
#define STM32_FDCANSEL_HSE     STM32_FDCANSEL_FIELD(0U)
#define STM32_FDCANSEL_PLL1Q   STM32_FDCANSEL_FIELD(1U)
#define STM32_FDCANSEL_PLL2Q   STM32_FDCANSEL_FIELD(2U)

#define STM32_SAI1SEL_MASK     (7U << 16)
#define STM32_SAI1SEL_FIELD(n) ((n) << 16)
#define STM32_SAI1SEL_PLL1Q    STM32_SAI1SEL_FIELD(0U)
#define STM32_SAI1SEL_PLL2P    STM32_SAI1SEL_FIELD(1U)
#define STM32_SAI1SEL_PLL3P    STM32_SAI1SEL_FIELD(2U)
#define STM32_SAI1SEL_AUDIOCLK STM32_SAI1SEL_FIELD(3U)
#define STM32_SAI1SEL_PER      STM32_SAI1SEL_FIELD(4U)

