ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
#define STM32_0WS_THRESHOLD             STM32_VOS2_0WS_THRESHOLD
#define STM32_1WS_THRESHOLD             STM32_VOS2_1WS_THRESHOLD
#define STM32_2WS_THRESHOLD             STM32_VOS2_2WS_THRESHOLD
#define STM32_3WS_THRESHOLD             STM32_VOS2_3WS_THRESHOLD
#define STM32_4WS_THRESHOLD             STM32_VOS2_4WS_THRESHOLD
#define STM32_5WS_THRESHOLD             STM32_VOS2_5WS_THRESHOLD
#define STM32_6WS_THRESHOLD             STM32_VOS2_6WS_THRESHOLD
#define STM32_7WS_THRESHOLD             STM32_VOS2_7WS_THRESHOLD
#define STM32_8WS_THRESHOLD             STM32_VOS2_8WS_THRESHOLD

#elif (STM32_PWR_VOSCR & STM32_VOS_MASK) == STM32_VOS_RANGE3
#define STM32_SYSCLK_MAX                STM32_VOS3_SYSCLK_MAX
#define STM32_HSECLK_MAX                STM32_VOS3_HSECLK_MAX
#define STM32_HSECLK_BYP_MAX            STM32_VOS3_HSECLK_BYP_MAX
#define STM32_HSECLK_MIN                STM32_VOS3_HSECLK_MIN
#define STM32_HSECLK_BYP_MIN            STM32_VOS3_HSECLK_BYP_MIN
#define STM32_LSECLK_MAX                STM32_VOS3_LSECLK_MAX
#define STM32_LSECLK_BYP_MAX            STM32_VOS3_LSECLK_BYP_MAX
#define STM32_LSECLK_MIN                STM32_VOS3_LSECLK_MIN
#define STM32_LSECLK_BYP_MIN            STM32_VOS3_LSECLK_BYP_MIN
#define STM32_PLLIN_MAX                 STM32_VOS3_PLLIN_MAX
#define STM32_PLLIN_MIN                 STM32_VOS3_PLLIN_MIN
#define STM32_PLLVCO_MAX                STM32_VOS3_PLLVCO_MAX
#define STM32_PLLVCO_MIN                STM32_VOS3_PLLVCO_MIN
#define STM32_PLLP_MAX                  STM32_VOS3_PLLP_MAX
#define STM32_PLLP_MIN                  STM32_VOS3_PLLP_MIN
#define STM32_PLLQ_MAX                  STM32_VOS3_PLLQ_MAX
#define STM32_PLLQ_MIN                  STM32_VOS3_PLLQ_MIN
#define STM32_PLLR_MAX                  STM32_VOS3_PLLR_MAX
#define STM32_PLLR_MIN                  STM32_VOS3_PLLR_MIN
#define STM32_PCLK1_MAX                 STM32_VOS3_PCLK1_MAX
#define STM32_PCLK2_MAX                 STM32_VOS3_PCLK2_MAX
#define STM32_PCLK3_MAX                 STM32_VOS3_PCLK3_MAX
#define STM32_ADCCLK_MAX                STM32_VOS3_ADCCLK_MAX

#define STM32_0WS_THRESHOLD             STM32_VOS3_0WS_THRESHOLD
#define STM32_1WS_THRESHOLD             STM32_VOS3_1WS_THRESHOLD
#define STM32_2WS_THRESHOLD             STM32_VOS3_2WS_THRESHOLD
#define STM32_3WS_THRESHOLD             STM32_VOS3_3WS_THRESHOLD
#define STM32_4WS_THRESHOLD             STM32_VOS3_4WS_THRESHOLD
#define STM32_5WS_THRESHOLD             STM32_VOS3_5WS_THRESHOLD
#define STM32_6WS_THRESHOLD             STM32_VOS3_6WS_THRESHOLD
#define STM32_7WS_THRESHOLD             STM32_VOS3_7WS_THRESHOLD
#define STM32_8WS_THRESHOLD             STM32_VOS3_8WS_THRESHOLD

#else
#error "invalid STM32_VOS value specified"
#endif

/**
 * @name    PLLs dividers ranges
 * @{
 */
#define STM32_PLL1M_VALUE_MAX           63
#define STM32_PLL1M_VALUE_MIN           1
#define STM32_PLL1N_ODDVALID            TRUE
#define STM32_PLL1N_VALUE_MAX           512
#define STM32_PLL1N_VALUE_MIN           4
#define STM32_PLL1P_ODDVALID            FALSE
#define STM32_PLL1P_VALUE_MAX           128
#define STM32_PLL1P_VALUE_MIN           2
#define STM32_PLL1Q_ODDVALID            TRUE
#define STM32_PLL1Q_VALUE_MAX           128
#define STM32_PLL1Q_VALUE_MIN           1
#define STM32_PLL1R_ODDVALID            TRUE
#define STM32_PLL1R_VALUE_MAX           128
#define STM32_PLL1R_VALUE_MIN           1

#define STM32_PLL2M_VALUE_MAX           63
#define STM32_PLL2M_VALUE_MIN           1
#define STM32_PLL2N_ODDVALID            TRUE
#define STM32_PLL2N_VALUE_MAX           512
#define STM32_PLL2N_VALUE_MIN           4
#define STM32_PLL2P_ODDVALID            TRUE
#define STM32_PLL2P_VALUE_MAX           128
#define STM32_PLL2P_VALUE_MIN           2
#define STM32_PLL2Q_ODDVALID            TRUE
#define STM32_PLL2Q_VALUE_MAX           128
#define STM32_PLL2Q_VALUE_MIN           1
#define STM32_PLL2R_ODDVALID            TRUE
#define STM32_PLL2R_VALUE_MAX           128
#define STM32_PLL2R_VALUE_MIN           1

#define STM32_PLL3M_VALUE_MAX           63
#define STM32_PLL3M_VALUE_MIN           1
#define STM32_PLL3N_ODDVALID            TRUE
#define STM32_PLL3N_VALUE_MAX           512
#define STM32_PLL3N_VALUE_MIN           4
#define STM32_PLL3P_ODDVALID            TRUE
#define STM32_PLL3P_VALUE_MAX           128
#define STM32_PLL3P_VALUE_MIN           2
#define STM32_PLL3Q_ODDVALID            TRUE
#define STM32_PLL3Q_VALUE_MAX           128
#define STM32_PLL3Q_VALUE_MIN           1
#define STM32_PLL3R_ODDVALID            TRUE
#define STM32_PLL3R_VALUE_MAX           128
#define STM32_PLL3R_VALUE_MIN           1
/** @} */

/* Clock handlers.*/
#include "stm32_lsi.inc"
#include "stm32_csi.inc"
#include "stm32_hsi48.inc"
#include "stm32_hsidiv.inc"
#include "stm32_lse.inc"
#include "stm32_hse.inc"

/*
 * PLL1 enable check.
 */
#if (STM32_SW           == STM32_SW_PLL1P)          ||                      \
    (STM32_MCO1SEL      == STM32_MCO1SEL_PLL1P)     ||                      \
    (STM32_MCO2SEL      == STM32_MCO2SEL_PLL1P)     ||                      \
    (STM32_SPI1SEL      == STM32_SPI1SEL_PLL1Q)     ||                      \
    (STM32_SPI2SEL      == STM32_SPI2SEL_PLL1Q)     ||                      \
    (STM32_SPI3SEL      == STM32_SPI3SEL_PLL1Q)     ||                      \
    (STM32_OSPISEL      == STM32_OSPISEL_PLL1Q)     ||                      \
    (STM32_USBSEL       == STM32_USBSEL_PLL1Q)      ||                      \
    (STM32_SDMMC1SEL    == STM32_SDMMC1SEL_PLL1Q)   ||                      \
    (STM32_SDMMC2SEL    == STM32_SDMMC2SEL_PLL1Q)   ||                      \
    (STM32_RNGSEL       == STM32_RNGSEL_PLL1Q)      ||                      \
    (STM32_FDCANSEL     == STM32_FDCANSEL_PLL1Q)    ||                      \
    (STM32_SAI1SEL      == STM32_SAI1SEL_PLL1Q)     ||                      \
    (STM32_SAI2SEL      == STM32_SAI2SEL_PLL1Q)     ||                      \
    defined(__DOXYGEN__)
  /**
   * @brief   PLL1 activation flag.
   */
  #define STM32_ACTIVATE_PLL1       TRUE
#else

  #define STM32_ACTIVATE_PLL1       FALSE
#endif

