ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
/*
 * PLL2 enable check.
 */
#if (STM32_MCO2SEL      == STM32_MCO2SEL_PLL2P)     ||                      \
    (STM32_USART1SEL    == STM32_USART1SEL_PLL2Q)   ||                      \
    (STM32_USART2SEL    == STM32_USART2SEL_PLL2Q)   ||                      \
    (STM32_USART3SEL    == STM32_USART3SEL_PLL2Q)   ||                      \
    (STM32_UART4SEL     == STM32_UART4SEL_PLL2Q)    ||                      \
    (STM32_UART5SEL     == STM32_UART5SEL_PLL2Q)    ||                      \
    (STM32_USART6SEL    == STM32_USART6SEL_PLL2Q)   ||                      \
    (STM32_UART7SEL     == STM32_UART7SEL_PLL2Q)    ||                      \
    (STM32_UART8SEL     == STM32_UART8SEL_PLL2Q)    ||                      \
    (STM32_UART9SEL     == STM32_UART9SEL_PLL2Q)    ||                      \
    (STM32_USART10SEL   == STM32_USART10SEL_PLL2Q)  ||                      \
    (STM32_USART11SEL   == STM32_USART11SEL_PLL2Q)  ||                      \
    (STM32_UART12SEL    == STM32_UART12SEL_PLL2Q)   ||                      \
    (STM32_LPUART1SEL   == STM32_LPUART1SEL_PLL2Q)  ||                      \
    (STM32_LPTIM1SEL    == STM32_LPTIM1SEL_PLL2P)   ||                      \
    (STM32_LPTIM2SEL    == STM32_LPTIM2SEL_PLL2P)   ||                      \
    (STM32_LPTIM3SEL    == STM32_LPTIM3SEL_PLL2P)   ||                      \
    (STM32_LPTIM4SEL    == STM32_LPTIM4SEL_PLL2P)   ||                      \
    (STM32_LPTIM5SEL    == STM32_LPTIM5SEL_PLL2P)   ||                      \
    (STM32_LPTIM6SEL    == STM32_LPTIM6SEL_PLL2P)   ||                      \
    (STM32_SPI1SEL      == STM32_SPI1SEL_PLL2P)     ||                      \
    (STM32_SPI2SEL      == STM32_SPI2SEL_PLL2P)     ||                      \
    (STM32_SPI3SEL      == STM32_SPI3SEL_PLL2P)     ||                      \
    (STM32_SPI4SEL      == STM32_SPI4SEL_PLL2P)     ||                      \
    (STM32_SPI5SEL      == STM32_SPI5SEL_PLL2P)     ||                      \
    (STM32_SPI6SEL      == STM32_SPI6SEL_PLL2P)     ||                      \
    (STM32_OSPISEL      == STM32_OSPISEL_PLL2R )    ||                      \
    (STM32_SDMMC1SEL    == STM32_SDMMC1SEL_PLL2R)   ||                      \
    (STM32_SDMMC2SEL    == STM32_SDMMC2SEL_PLL2R)   ||                      \
    (STM32_ADCDACSEL    == STM32_ADCDACSEL_PLL2R)   ||                      \
    (STM32_FDCANSEL     == STM32_FDCANSEL_PLL2Q)    ||                      \
    (STM32_SAI1SEL      == STM32_SAI1SEL_PLL2P)     ||                      \
    (STM32_SAI2SEL      == STM32_SAI2SEL_PLL2P)     ||                      \
    defined(__DOXYGEN__)
  /**
   * @brief   PLL2 activation flag.
   */
  #define STM32_ACTIVATE_PLL2       TRUE
#else

  #define STM32_ACTIVATE_PLL2       FALSE
#endif

/*
 * PLL3 enable check.
 */
#if (STM32_USART1SEL    == STM32_USART1SEL_PLL3Q)   ||                      \
    (STM32_USART2SEL    == STM32_USART2SEL_PLL3Q)   ||                      \
    (STM32_USART3SEL    == STM32_USART3SEL_PLL3Q)   ||                      \
    (STM32_UART4SEL     == STM32_UART4SEL_PLL3Q)    ||                      \
    (STM32_UART5SEL     == STM32_UART5SEL_PLL3Q)    ||                      \
    (STM32_USART6SEL    == STM32_USART6SEL_PLL3Q)   ||                      \
    (STM32_UART7SEL     == STM32_UART7SEL_PLL3Q)    ||                      \
    (STM32_UART8SEL     == STM32_UART8SEL_PLL3Q)    ||                      \
    (STM32_UART9SEL     == STM32_UART9SEL_PLL3Q)    ||                      \
    (STM32_USART10SEL   == STM32_USART10SEL_PLL3Q)  ||                      \
    (STM32_USART11SEL   == STM32_USART11SEL_PLL3Q)  ||                      \
    (STM32_UART12SEL    == STM32_UART12SEL_PLL3Q)   ||                      \
    (STM32_LPUART1SEL   == STM32_LPUART1SEL_PLL3Q)  ||                      \
    (STM32_LPTIM1SEL    == STM32_LPTIM1SEL_PLL3R)   ||                      \
    (STM32_LPTIM2SEL    == STM32_LPTIM2SEL_PLL3R)   ||                      \
    (STM32_LPTIM3SEL    == STM32_LPTIM3SEL_PLL3R)   ||                      \
    (STM32_LPTIM4SEL    == STM32_LPTIM4SEL_PLL3R)   ||                      \
    (STM32_LPTIM5SEL    == STM32_LPTIM5SEL_PLL3R)   ||                      \
    (STM32_LPTIM6SEL    == STM32_LPTIM6SEL_PLL3R)   ||                      \
    (STM32_SPI1SEL      == STM32_SPI1SEL_PLL3P)     ||                      \
    (STM32_SPI2SEL      == STM32_SPI2SEL_PLL3P)     ||                      \
    (STM32_SPI3SEL      == STM32_SPI3SEL_PLL3P)     ||                      \
    (STM32_SPI4SEL      == STM32_SPI4SEL_PLL3P)     ||                      \
    (STM32_SPI5SEL      == STM32_SPI5SEL_PLL3P)     ||                      \
    (STM32_SPI6SEL      == STM32_SPI6SEL_PLL3P)     ||                      \
    (STM32_MCO1SEL      == STM32_MCO1SEL_PLL1P)     ||                      \
    (STM32_MCO2SEL      == STM32_MCO2SEL_PLL1P)     ||                      \
    (STM32_SPI1SEL      == STM32_SPI1SEL_PLL1Q)     ||                      \
    (STM32_SPI2SEL      == STM32_SPI2SEL_PLL1Q)     ||                      \
    (STM32_SPI3SEL      == STM32_SPI3SEL_PLL1Q)     ||                      \
    (STM32_USBSEL       == STM32_USBSEL_PLL3Q)      ||                      \
    (STM32_I2C1SEL      == STM32_I2C1SEL_PLL3R)     ||                      \
    (STM32_I2C2SEL      == STM32_I2C2SEL_PLL3R)     ||                      \
    (STM32_I2C3SEL      == STM32_I2C3SEL_PLL3R)     ||                      \
    (STM32_I2C4SEL      == STM32_I2C4SEL_PLL3R)     ||                      \
    (STM32_I3C1SEL      == STM32_I3C1SEL_PLL3R)     ||                      \
    (STM32_SAI1SEL      == STM32_SAI1SEL_PLL3P)     ||                      \
    (STM32_SAI2SEL      == STM32_SAI2SEL_PLL3P)     ||                      \
    defined(__DOXYGEN__)
  /**
   * @brief   PLL3 activation flag.
   */
  #define STM32_ACTIVATE_PLL3       TRUE
#else

  #define STM32_ACTIVATE_PLL3       FALSE
#endif

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if STM32_MCO2SEL == STM32_MCO2SEL_LSI
    #error "LSI not enabled, required by STM32_MCO2SEL"
  #endif

  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI)
    #error "HSI not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI)
    #error "HSI not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSI)
    #error "HSI not enabled, required by STM32_LPTIM3SEL"
  #endif
  #if (STM32_LPTIM4SEL == STM32_LPTIM4SEL_LSI)
    #error "HSI not enabled, required by STM32_LPTIM4SEL"
  #endif
  #if (STM32_LPTIM5SEL == STM32_LPTIM5SEL_LSI)
    #error "HSI not enabled, required by STM32_LPTIM5SEL"
  #endif
  #if (STM32_LPTIM6SEL == STM32_LPTIM6SEL_LSI)
    #error "HSI not enabled, required by STM32_LPTIM6SEL"
  #endif

  #if STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSI
    #error "LSI not enabled, required by STM32_SYSTICKSEL"
  #endif

  #if STM32_RNGSEL == STM32_RNGSEL_LSI
    #error "LSI not enabled, required by STM32_RNGSEL"
  #endif

  #if STM32_DACSEL == STM32_DACSEL_LSI
    #error "LSI not enabled, required by STM32_DACSEL"
  #endif

  #if STM32_CECSEL == STM32_CECSEL_LSI
    #error "LSI not enabled, required by STM32_CECSEL"
  #endif

