ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
#elif STM32_USART10SEL == STM32_USART10SEL_LSE
  #define STM32_USART10CLK          STM32_LSECLK

#else
  #error "invalid source selected for USART10 clock"
#endif

/**
 * @brief   USART11 clock frequency.
 */
#if (STM32_USART11SEL == STM32_USART11SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART11CLK          hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_USART11SEL == STM32_USART11SEL_PLL2Q
  #define STM32_USART11CLK          hal_lld_get_clock_point(CLK_PLL2Q)

#elif STM32_USART11SEL == STM32_USART11SEL_PLL3Q
  #define STM32_USART11CLK          hal_lld_get_clock_point(CLK_PLL3Q)

#elif STM32_USART11SEL == STM32_USART11SEL_HSI
  #define STM32_USART11CLK          STM32_HSICLK

#elif STM32_USART11SEL == STM32_USART11SEL_CSI
  #define STM32_USART11CLK          STM32_CSICLK

#elif STM32_USART11SEL == STM32_USART11SEL_LSE
  #define STM32_USART11CLK          STM32_LSECLK

#else
  #error "invalid source selected for USART11 clock"
#endif

/**
 * @brief   UART12 clock frequency.
 */
#if (STM32_UART12SEL == STM32_UART12SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART12CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART12SEL == STM32_UART12SEL_PLL2Q
  #define STM32_UART12CLK           hal_lld_get_clock_point(CLK_PLL2Q)

#elif STM32_UART12SEL == STM32_UART12SEL_PLL3Q
  #define STM32_UART12CLK           hal_lld_get_clock_point(CLK_PLL3Q)

#elif STM32_UART12SEL == STM32_UART12SEL_HSI
  #define STM32_UART12CLK           STM32_HSICLK

#elif STM32_UART12SEL == STM32_UART12SEL_CSI
  #define STM32_UART12CLK           STM32_CSICLK

#elif STM32_UART12SEL == STM32_UART12SEL_LSE
  #define STM32_UART12CLK           STM32_LSECLK

#else
  #error "invalid source selected for UART12 clock"
#endif

/**
 * @brief   LPUART1 clock frequency.
 */
#if (STM32_LPUART1SEL == STM32_LPUART1SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_PLL2Q
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2Q)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_PLL3Q
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3Q)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_HSI
  #define STM32_LPUART1CLK          STM32_HSICLK

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_CSI
  #define STM32_LPUART1CLK          STM32_CSICLK

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_LSE
  #define STM32_LPUART1CLK          STM32_LSECLK

#else
  #error "invalid source selected for LPUART1 clock"
#endif

#if (STM32_TIMICSEL == STM32_TIMICSEL_NOCLK) || defined(__DOXYGEN__)
  /**
   * @brief   TIM12 internal capture clock frequency.
   */
  #define STM32_TIM12CCLK           0
  /**
   * @brief   TIM15 internal capture clock frequency.
   */
  #define STM32_TIM15CCLK           0
  /**
   * @brief   LPTIM2 internal capture clock frequency.
   */
  #define STM32_LPTIM2CCLK          0

#elif STM32_TIMICSEL == STM32_TIMICSEL_INTCLK
  #define STM32_TIM12CCLK           (STM32_HSICLK / 1024)
  #define STM32_TIM15CCLK           (STM32_HSICLK / 8)
  #define STM32_LPTIM2CCLK          (STM32_CSICLK / 128)

#else
  #error "invalid source selected for TIMICSEL clock"
#endif

/**
 * @brief   LPTIM1 clock frequency.
 */
#if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPTIM1CLK           hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PLL2P
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2P)

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PLL3R
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3R)

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE
  #define STM32_LPTIM1CLK           STM32_LSECLK

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI
  #define STM32_LPTIM1CLK           STM32_LSICLK

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PER
  #define STM32_LPTIM1CLK           STM32_PERCLK

#else
  #error "invalid source selected for LPTIM1 clock"
#endif

/**
 * @brief   LPTIM2 clock frequency.
 */
#if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_LPTIM2CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PLL2P
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2P)

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PLL3R
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3R)

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE
  #define STM32_LPTIM2CLK           STM32_LSECLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI
  #define STM32_LPTIM2CLK           STM32_LSICLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PER
  #define STM32_LPTIM2CLK           STM32_PERCLK

#else
  #error "invalid source selected for LPTIM2 clock"
#endif

/**
 * @brief   LPTIM3 clock frequency.
 */
#if (STM32_LPTIM3SEL == STM32_LPTIM3SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPTIM3CLK           hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_PLL2P
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2P)

#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_PLL3R
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3R)

#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSE
  #define STM32_LPTIM3CLK           STM32_LSECLK

#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSI
  #define STM32_LPTIM3CLK           STM32_LSICLK

#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_PER
  #define STM32_LPTIM3CLK           STM32_PERCLK

#else
  #error "invalid source selected for LPTIM3 clock"
#endif

/**
 * @brief   LPTIM4 clock frequency.
 */
#if (STM32_LPTIM4SEL == STM32_LPTIM4SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPTIM4CLK           hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPTIM4SEL == STM32_LPTIM4SEL_PLL2P
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2P)

#elif STM32_LPTIM4SEL == STM32_LPTIM4SEL_PLL3R
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3R)

#elif STM32_LPTIM4SEL == STM32_LPTIM4SEL_LSE
  #define STM32_LPTIM4CLK           STM32_LSECLK

#elif STM32_LPTIM4SEL == STM32_LPTIM4SEL_LSI
  #define STM32_LPTIM4CLK           STM32_LSICLK

