ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
#elif STM32_FDCANSEL == STM32_FDCANSEL_PLL1Q
  #define STM32_FDCANCLK            hal_lld_get_clock_point(CLK_PLL1Q)

#elif STM32_FDCANSEL == STM32_FDCANSEL_PLL2Q
  #define STM32_FDCANCLK            hal_lld_get_clock_point(CLK_PLL2Q)

#else
  #error "invalid source selected for FDCAN clock"
#endif

/**
 * @brief   SAI1 clock frequency.
 */
#if (STM32_SAI1SEL == STM32_SAI1SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_SAI1CLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_SAI1SEL == STM32_SAI1SEL_PLL1Q
  #define STM32_SAI1CLK             hal_lld_get_clock_point(CLK_PLL1Q)

#elif STM32_SAI1SEL == STM32_SAI2SEL_PLL2P
  #define STM32_SAI1CLK             hal_lld_get_clock_point(CLK_PLL2P)

#elif STM32_SAI1SEL == STM32_SAI1SEL_PLL3P
  #define STM32_SAI1CLK             hal_lld_get_clock_point(CLK_PLL3P)

#elif STM32_SAI1SEL == STM32_SAI1SEL_AUDIOCLK
  #define STM32_SAI1CLK             0 /* TODO board.h */

#elif STM32_SAI1SEL == STM32_SAI1SEL_PER
  #define STM32_SAI1CLK             STM32_PERCLK

#else
  #error "invalid source selected for SAI1 clock"
#endif

/**
 * @brief   SAI2 clock frequency.
 */
#if (STM32_SAI2SEL == STM32_SAI2SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_SAI2CLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_SAI2SEL == STM32_SAI2SEL_PLL1Q
  #define STM32_SAI2CLK             hal_lld_get_clock_point(CLK_PLL1Q)

#elif STM32_SAI2SEL == STM32_SAI2SEL_PLL2P
  #define STM32_SAI2CLK             hal_lld_get_clock_point(CLK_PLL2P)

#elif STM32_SAI2SEL == STM32_SAI2SEL_PLL3P
  #define STM32_SAI2CLK             hal_lld_get_clock_point(CLK_PLL3P)

#elif STM32_SAI2SEL == STM32_SAI2SEL_AUDIOCLK
  #define STM32_SAI2CLK             0 /* TODO board.h */

#elif STM32_SAI2SEL == STM32_SAI2SEL_PER
  #define STM32_SAI2CLK             STM32_PERCLK

#else
  #error "invalid source selected for SAI2 clock"
#endif

#if (STM32_TIMPRE == STM32_TIMPRE_LOW) || defined(__DOXYGEN__)
  /**
   * @brief   TIMP1CLK clock frequency.
   */
  #if (STM32_PPRE1 == STM32_PPRE1_DIV1) ||                                  \
      (STM32_PPRE1 == STM32_PPRE1_DIV2) || defined(__DOXYGEN__)
    #define STM32_TIMP1CLK            STM32_HCLK
  #else
    #define STM32_TIMP1CLK            (STM32_PCLK1 * 2)
  #endif

  /**
   * @brief   TIMP2CLK clock frequency.
   */
  #if (STM32_PPRE2 == STM32_PPRE2_DIV1) ||                                  \
      (STM32_PPRE2 == STM32_PPRE2_DIV2) || defined(__DOXYGEN__)
    #define STM32_TIMP2CLK            STM32_HCLK
  #else
    #define STM32_TIMP2CLK            (STM32_PCLK2 * 2)
  #endif

#else
  #if (STM32_PPRE1 == STM32_PPRE1_DIV1) ||                                  \
      (STM32_PPRE1 == STM32_PPRE1_DIV2) ||                                  \
      (STM32_PPRE1 == STM32_PPRE1_DIV4) || defined(__DOXYGEN__)
    #define STM32_TIMP1CLK            (STM32_PCLK1 * 2)
  #else
    #define STM32_TIMP1CLK            (STM32_PCLK1 * 4)
  #endif

  #if (STM32_PPRE2 == STM32_PPRE2_DIV1) ||                                  \
      (STM32_PPRE2 == STM32_PPRE2_DIV2) ||                                  \
      (STM32_PPRE2 == STM32_PPRE2_DIV4) || defined(__DOXYGEN__)
    #define STM32_TIMP2CLK            (STM32_PCLK2 * 2)
  #else
    #define STM32_TIMP2CLK            (STM32_PCLK2 * 4)
  #endif
#endif

/**
 * @brief   ETH clock frequency.
 */
#define STM32_ETHCLK               hal_lld_get_clock_point(CLK_PLL1Q)

/**
 * @brief   Clock of timers connected to APB1.
 */
#define STM32_TIMCLK1               hal_lld_get_clock_point(CLK_PCLK1TIM)

/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2               hal_lld_get_clock_point(CLK_PCLK2TIM)

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_0WS

#elif STM32_HCLK <= STM32_1WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_1WS

#elif STM32_HCLK <= STM32_2WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_2WS

#elif STM32_HCLK <= STM32_3WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_3WS

#elif STM32_HCLK <= STM32_4WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_4WS

#else
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_5WS
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a clock point identifier.
 */
typedef unsigned halclkpt_t;

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Type of a clock point frequency in Hz.
 */
typedef uint32_t halfreq_t;

/**
 * @brief   Type of a clock configuration structure.
 */
typedef struct {
  uint32_t          pwr_voscr;
  uint32_t          pwr_vmcr;
  uint32_t          rcc_cr;
  uint32_t          rcc_cfgr1;
  uint32_t          rcc_cfgr2;
  uint32_t          rcc_pll1cfgr;
  uint32_t          rcc_pll2cfgr;
  uint32_t          rcc_pll3cfgr;
  uint32_t          rcc_pll1divr;
  uint32_t          rcc_pll1fracr;
  uint32_t          rcc_pll2divr;
  uint32_t          rcc_pll2fracr;
  uint32_t          rcc_pll3divr;
  uint32_t          rcc_pll3fracr;
  uint32_t          flash_acr;
} halclkcfg_t;
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

#if !defined(HAL_LLD_USE_CLOCK_MANAGEMENT)
/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_SYSCLK    ? STM32_SYSCLK          :                       \
   (clkpt) == CLK_PLL1PCLK  ? STM32_PLL1_P_CLKOUT   :                       \
   (clkpt) == CLK_PLL1QCLK  ? STM32_PLL1_Q_CLKOUT   :                       \
   (clkpt) == CLK_PLL1RCLK  ? STM32_PLL1_R_CLKOUT   :                       \
   (clkpt) == CLK_PLL2PCLK  ? STM32_PLL2_P_CLKOUT   :                       \
   (clkpt) == CLK_PLL2QCLK  ? STM32_PLL2_Q_CLKOUT   :                       \
   (clkpt) == CLK_PLL2RCLK  ? STM32_PLL2_R_CLKOUT   :                       \
   (clkpt) == CLK_PLL3PCLK  ? STM32_PLL3_P_CLKOUT   :                       \
   (clkpt) == CLK_PLL3QCLK  ? STM32_PLL3_Q_CLKOUT   :                       \
   (clkpt) == CLK_PLL3RCLK  ? STM32_PLL3_R_CLKOUT   :                       \
   (clkpt) == CLK_HCLK      ? STM32_HCLK            :                       \
   (clkpt) == CLK_PCLK1     ? STM32_PCLK1           :                       \
   (clkpt) == CLK_PCLK1TIM  ? STM32_TIMP1CLK        :                       \
   (clkpt) == CLK_PCLK2     ? STM32_PCLK2           :                       \
   (clkpt) == CLK_PCLK2TIM  ? STM32_TIMP2CLK        :                       \
   (clkpt) == CLK_PCLK2     ? STM32_PCLK3           :                       \
   (clkpt) == CLK_MCO1      ? STM32_MCO1CLK         :                       \
   (clkpt) == CLK_MCO2      ? STM32_MCO2CLK         :                       \
   (clkpt) == CLK_LSCO      ? STM32_LSCOCLK         :                       \
   0U)
#endif /* !defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
//#include "mpu_v8m.h"
#include "stm32_isr.h"
//#include "stm32_dma.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) && !defined(__DOXYGEN__)
extern const halclkcfg_t hal_clkcfg_reset;
extern const halclkcfg_t hal_clkcfg_default;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
  bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp);
  halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt);
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
